[
  {
    "name": "G8 ThinQ",
    "description": "LG G8 ThinQ Android smartphone. Announced Feb 2019. Features 6.1″  display, Snapdragon 855 chipset, 3500 mAh battery, 128 GB storage, 6 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 5.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-g8-thinq-r1.jpg"
  },
  {
    "name": "G7 ThinQ",
    "description": "LG G7 ThinQ Android smartphone. Announced May 2018. Features 6.1″  display, Snapdragon 845 chipset, Dual: 16 MP (f/1.6, 1/3.1″, 1.0µm, OIS) + 16 MP primary camera, 8 MP front camera, 3000 mAh battery, 128 GB storage, 6 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 5.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-g7-thinq-.jpg"
  },
  {
    "name": "V60 ThinQ 5G",
    "description": "LG V60 ThinQ 5G Android smartphone. Announced Feb 2020. Features 6.8″  display, Snapdragon 865 5G chipset, 5000 mAh battery, 256 GB storage, 8 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 5.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-v60-thinq-5g-b.jpg"
  },
  {
    "name": "V50 ThinQ 5G",
    "description": "LG V50 ThinQ 5G Android smartphone. Announced Feb 2019. Features 6.4″  display, Snapdragon 855 chipset, 4000 mAh battery, 128 GB storage, 6 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 5.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-gv50-thinq-.jpg"
  },
  {
    "name": "Velvet 5G",
    "description": "LG Velvet 5G Android smartphone. Announced May 2020. Features 6.8″  display, Snapdragon 765G 5G chipset, 4300 mAh battery, 128 GB storage, 8 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-velvet-.jpg"
  },
  {
    "name": "G6",
    "description": "LG G6 Android smartphone. Announced Feb 2017. Features 5.7″  display, Snapdragon 821 chipset, Dual: 13 MP (f/1.8, 30mm, 1/3″, 1.12µm, 3-axis OIS, PDAF) + 13 MP primary camera, 5 MP front camera, 3300 mAh battery, 128 GB storage, 4 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 3.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-g6-new.jpg"
  },
  {
    "name": "W41 Pro",
    "description": "LG W41 Pro Android smartphone. Announced Feb 2021. Features 6.55″  display, MediaTek MT6765G Helio G35 chipset, 5000 mAh battery, 128 GB storage, 6 GB RAM.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-w41-pro.jpg"
  },
  {
    "name": "V30",
    "description": "LG V30 Android smartphone. Announced Aug 2017. Features 6.0″  display, Snapdragon 835 chipset, Dual: 16 MP (f/1.6, 1µm, 3-axis OIS, PDAF & laser AF) + 13 MP primary camera, 5 MP front camera, 3300 mAh battery, 128 GB storage, 4 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 5.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-v30-.jpg"
  },
  {
    "name": "V40 ThinQ",
    "description": "LG V40 ThinQ Android smartphone. Announced Oct 2018. Features 6.4″  display, Snapdragon 845 chipset, 3300 mAh battery, 128 GB storage, 6 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 5.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-v40-carmine-red.jpg"
  },
  {
    "name": "Wing 5G",
    "description": "LG Wing 5G Android smartphone. Announced Sep 2020. Features 6.8″  display, Snapdragon 765G 5G chipset, 4000 mAh battery, 256 GB storage, 8 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 5.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-wing.jpg"
  },
  {
    "name": "G8X ThinQ",
    "description": "LG G8X ThinQ Android smartphone. Announced Sep 2019. Features 6.4″  display, Snapdragon 855 chipset, 4000 mAh battery, 128 GB storage, 6 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 6.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-g8x-thinq.jpg"
  },
  {
    "name": "V20",
    "description": "LG V20 Android smartphone. Announced Sep 2016. Features 5.7″  display, Snapdragon 820 chipset, Dual: 16 MP (f/1.8, 29mm, 1/2.6″, laser AF, 3-axis OIS) + 8 MP primary camera, 5 MP front camera, 3200 mAh battery, 64 GB storage, 4 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 4.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-v20-ofic1.jpg"
  },
  {
    "name": "G5",
    "description": "LG G5 Android smartphone. Announced Feb 2016. Features 5.3″  display, Snapdragon 820 chipset, Dual: 16 MP (f/1.8, 26mm, 1/2.6″, laser AF, 3-axis OIS) + 8 MP primary camera, 8 MP front camera, 2800 mAh battery, 32 GB storage, 4 GB RAM, Corning Gorilla Glass 4.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-g5.jpg"
  },
  {
    "name": "V50S ThinQ 5G",
    "description": "LG V50S ThinQ 5G Android smartphone. Announced Oct 2019. Features 6.4″  display, Snapdragon 855 chipset, 4000 mAh battery, 256 GB storage, 8 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 5.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-g8x-thinq.jpg"
  },
  {
    "name": "K92 5G",
    "description": "LG K92 5G Android smartphone. Announced Sep 2020. Features 6.7″  display, Snapdragon 690 5G chipset, 4000 mAh battery, 128 GB storage, 6 GB RAM.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k92-5g.jpg"
  },
  {
    "name": "G4",
    "description": "LG G4 Android smartphone. Announced Apr 2015. Features 5.5″  display, Snapdragon 808 chipset, 16 MP primary camera, 8 MP front camera, 3000 mAh battery, 32 GB storage, 3 GB RAM, Corning Gorilla Glass 3.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-g4-.jpg"
  },
  {
    "name": "Velvet",
    "description": "LG Velvet Android smartphone. Announced Jul 2020. Features 6.8″  display, Snapdragon 845 chipset, 4300 mAh battery, 128 GB storage, 6 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-velvet-4g.jpg"
  },
  {
    "name": "G3",
    "description": "LG G3 Android smartphone. Announced May 2014. Features 5.5″  display, Snapdragon 801 chipset, 13 MP primary camera, 2.1 MP front camera, 3000 mAh battery, 32 GB storage, 3 GB RAM, Corning Gorilla Glass 3.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-g3-1.jpg"
  },
  {
    "name": "Q92 5G",
    "description": "LG Q92 5G Android smartphone. Announced Aug 2020. Features 6.67″  display, Snapdragon 765G 5G chipset, 4000 mAh battery, 128 GB storage, 6 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-q92.jpg"
  },
  {
    "name": "Q6",
    "description": "LG Q6 Android smartphone. Announced Jul 2017. Features 5.5″  display, Snapdragon 435 chipset, 13 MP primary camera, 5 MP front camera, 3000 mAh battery, 64 GB storage, 4 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 3.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-q6.jpg"
  },
  {
    "name": "Nexus 5",
    "description": "LG Nexus 5 Android smartphone. Announced Oct 2013. Features 4.95″  display, Snapdragon 800 chipset, 8 MP primary camera, 1.3 MP front camera, 2300 mAh battery, 32 GB storage, 2 GB RAM, Corning Gorilla Glass 3.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-google-nexus-5-.jpg"
  },
  {
    "name": "Stylo 6",
    "description": "LG Stylo 6 Android smartphone. Announced May 2020. Features 6.8″  display, MT6765 Helio P35 chipset, 4000 mAh battery, 64 GB storage, 3 GB RAM.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-stylo6.jpg"
  },
  {
    "name": "V35 ThinQ",
    "description": "LG V35 ThinQ Android smartphone. Announced May 2018. Features 6.0″  display, Snapdragon 845 chipset, Dual: 16 MP (f/1.6, 1/3.1″, 1.0µm, OIS) + 16 MP primary camera, 3300 mAh battery, 128 GB storage, 6 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 5.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-v35-.jpg"
  },
  {
    "name": "Nexus 5X",
    "description": "LG Nexus 5X Android smartphone. Announced Sep 2015. Features 5.2″  display, Snapdragon 808 chipset, 12.3 MP primary camera, 5 MP front camera, 2700 mAh battery, 32 GB storage, 2 GB RAM, Corning Gorilla Glass 3.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-nexus-5x-.jpg"
  },
  {
    "name": "G8S ThinQ",
    "description": "LG G8S ThinQ Android smartphone. Announced Feb 2019. Features 6.21″  display, Snapdragon 855 chipset, 3550 mAh battery, 128 GB storage, 6 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 5.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-g8s-thinq.jpg"
  },
  {
    "name": "Velvet 5G UW",
    "description": "LG Velvet 5G UW Android smartphone. Announced Aug 2020. Features 6.8″  display, Snapdragon 765G 5G chipset, 4300 mAh battery, 128 GB storage, 6 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-velvet-5g-uw-.jpg"
  },
  {
    "name": "V10",
    "description": "LG V10 Android smartphone. Announced Oct 2015. Features 5.7″  display, Snapdragon 808 chipset, 16 MP primary camera, Dual: 5 MP front camera, 3000 mAh battery, 64 GB storage, 4 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 4.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-v10-new1.jpg"
  },
  {
    "name": "V60 ThinQ 5G UW",
    "description": "LG V60 ThinQ 5G UW Android smartphone. Announced Feb 2020. Features 6.8″  display, Snapdragon 865 5G chipset, 5000 mAh battery, 128 GB storage, 8 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 5.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-v60-thinq-5g-b.jpg"
  },
  {
    "name": "W41+",
    "description": "LG W41+ Android smartphone. Announced Feb 2021. Features 6.55″  display, MediaTek MT6765G Helio G35 chipset, 5000 mAh battery, 128 GB storage, 4 GB RAM.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-w41-plus.jpg"
  },
  {
    "name": "G2",
    "description": "LG G2 Android smartphone. Announced Aug 2013. Features 5.2″  display, Snapdragon 800 chipset, 13 MP primary camera, 2.1 MP front camera, 3000 mAh battery, 32 GB storage, 2 GB RAM, Corning Gorilla Glass 2.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-g2-ofic.jpg"
  },
  {
    "name": "K10",
    "description": "LG K10 Android smartphone. Announced Jan 2016. Features 5.3″  display, Snapdragon 410 chipset, 13 MP primary camera, 5 MP (f/2.4) or 8 MP front camera, 2300 mAh battery, 16 GB storage, 1.5 GB RAM, Corning Gorilla Glass 3.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k10.jpg"
  },
  {
    "name": "K42",
    "description": "LG K42 Android smartphone. Announced Sep 2020. Features 6.6″  display, MT6762 Helio P22 chipset, 4000 mAh battery, 64 GB storage, 3 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k42.jpg"
  },
  {
    "name": "Q Stylo 4",
    "description": "LG Q Stylo 4 Android smartphone. Announced Jun 2018. Features 6.2″  display, Snapdragon 450 chipset, 13 MP primary camera, 5 MP front camera, 3300 mAh battery, 32 GB storage, 2 GB RAM.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-stylo-4-q710ms.jpg"
  },
  {
    "name": "Stylo 5",
    "description": "LG Stylo 5 Android smartphone. Announced Jun 2019. Features 6.2″  display, Snapdragon 450 chipset, 3500 mAh battery, 32 GB storage, 3 GB RAM.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-stylo-5.jpg"
  },
  {
    "name": "Q9",
    "description": "LG Q9 Android smartphone. Announced Jan 2019. Features 6.1″  display, Snapdragon 821 chipset, 3000 mAh battery, 64 GB storage, 4 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-q9-.jpg"
  },
  {
    "name": "K51S",
    "description": "LG K51S Android smartphone. Announced Feb 2020. Features 6.55″  display, MT6765 Helio P35 chipset, 4000 mAh battery, 64 GB storage, 3 GB RAM, MIL-STD-810G compliant, Scratch-resistant glass.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k51s.jpg"
  },
  {
    "name": "Q60",
    "description": "LG Q60 Android smartphone. Announced Feb 2019. Features 6.26″  display, MT6762 Helio P22 chipset, 3500 mAh battery, 64 GB storage, 3 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-q60-.jpg"
  },
  {
    "name": "Q7",
    "description": "LG Q7 Android smartphone. Announced May 2018. Features 5.5″  display, MT6750S chipset, 13 MP primary camera, 5 MP front camera, 3000 mAh battery, 64 GB storage, 4 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-q7-.jpg"
  },
  {
    "name": "K71",
    "description": "LG K71 Android smartphone. Announced Sep 2020. Features 6.8″  display, MT6765 Helio P35 chipset, 4000 mAh battery, 128 GB storage, 4 GB RAM.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-stylo6.jpg"
  },
  {
    "name": "K40",
    "description": "LG K40 Android smartphone. Announced Feb 2019. Features 5.7″  display, MT6762 Helio P22 chipset, 3000 mAh battery, 32 GB storage, 3 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k40-.jpg"
  },
  {
    "name": "W41",
    "description": "LG W41 Android smartphone. Announced Feb 2021. Features 6.55″  display, MediaTek MT6765G Helio G35 chipset, 5000 mAh battery, 64 GB storage, 4 GB RAM.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-w41.jpg"
  },
  {
    "name": "K61",
    "description": "LG K61 Android smartphone. Announced Feb 2020. Features 6.53″  display, MT6765 Helio P35 chipset, 4000 mAh battery, 128 GB storage, 4 GB RAM, MIL-STD-810G compliant, Scratch-resistant glass.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k61-new.jpg"
  },
  {
    "name": "Q52",
    "description": "LG Q52 Android smartphone. Announced Sep 2020. Features 6.6″  display, MT6765 Helio P35 chipset, 4000 mAh battery, 64 GB storage, 4 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-q52.jpg"
  },
  {
    "name": "K52",
    "description": "LG K52 Android smartphone. Announced Sep 2020. Features 6.6″  display, MT6765 Helio P35 chipset, 4000 mAh battery, 64 GB storage, 4 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k52.jpg"
  },
  {
    "name": "K8",
    "description": "LG K8 Android smartphone. Announced Feb 2016. Features 5.0″  display, MT6735 chipset, 8 MP primary camera, 5 MP front camera, 2125 mAh battery, 16 GB storage, 1.5 GB RAM.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k8-.jpg"
  },
  {
    "name": "G7 One",
    "description": "LG G7 One Android smartphone. Announced Aug 2018. Features 6.1″  display, Snapdragon 835 chipset, 16 MP primary camera, 8 MP front camera, 3000 mAh battery, 64 GB storage, 4 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-g7-one.jpg"
  },
  {
    "name": "W31",
    "description": "LG W31 Android smartphone. Announced Nov 2020. Features 6.52″  display, MT6762 Helio P22 chipset, 4000 mAh battery, 128 GB storage, 4 GB RAM.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-w31.jpg"
  },
  {
    "name": "K22",
    "description": "LG K22 Android smartphone. Announced Sep 2020. Features 6.2″  display, Snapdragon 215 chipset, 3000 mAh battery, 64 GB storage, 3 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k22.jpg"
  },
  {
    "name": "K62",
    "description": "LG K62 Android smartphone. Announced Sep 2020. Features 6.6″  display, MT6765 Helio P35 chipset, 4000 mAh battery, 128 GB storage, 4 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k62.jpg"
  },
  {
    "name": "Q61",
    "description": "LG Q61 Android smartphone. Announced May 2020. Features 6.53″  display, MT6765 Helio P35 chipset, 4000 mAh battery, 64 GB storage, 4 GB RAM, MIL-STD-810G compliant, Scratch-resistant glass.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-q61.jpg"
  },
  {
    "name": "Folder 2",
    "description": "LG Folder 2 phone. Announced Apr 2020. Features 2.8″  display, 1470 mAh battery, 8 GB storage, 1000 MB RAM.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-folder2.jpg"
  },
  {
    "name": "W31+",
    "description": "LG W31+ Android smartphone. Announced Nov 2020. Features 6.52″  display, MT6762 Helio P22 chipset, 4000 mAh battery, 128 GB storage, 4 GB RAM.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-w31-plus.jpg"
  },
  {
    "name": "Nexus 4 E960",
    "description": "LG Nexus 4 E960 Android smartphone. Announced Oct 2012. Features 4.7″  display, Snapdragon S4 Pro chipset, 8 MP primary camera, 1.3 MP front camera, 2100 mAh battery, 16 GB storage, 2 GB RAM, Corning Gorilla Glass 2.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-nexus-4-new.jpg"
  },
  {
    "name": "K10 (2017)",
    "description": "LG K10 (2017) Android smartphone. Announced Dec 2016. Features 5.3″  display, MT6750 chipset, 13 MP primary camera, 5 MP front camera, 2800 mAh battery, 32 GB storage, 2 GB RAM.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k10-2017.jpg"
  },
  {
    "name": "K41S",
    "description": "LG K41S Android smartphone. Announced Feb 2020. Features 6.55″  display, MT6762 Helio P22 chipset, 4000 mAh battery, 32 GB storage, 3 GB RAM, MIL-STD-810G compliant, Scratch-resistant glass.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k41ss.jpg"
  },
  {
    "name": "V30S ThinQ",
    "description": "LG V30S ThinQ Android smartphone. Announced Feb 2018. Features 6.0″  display, Snapdragon 835 chipset, Dual: 16 MP (f/1.6, 1µm, 3-axis OIS, PDAF & laser AF) + 13 MP primary camera, 5 MP front camera, 3300 mAh battery, 256 GB storage, 6 GB RAM, MIL-STD-810G compliant, Corning Gorilla Glass 5.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-v30s-thinq.jpg"
  },
  {
    "name": "K30",
    "description": "LG K30 Android smartphone. Announced May 2018. Features 5.3″  display, Snapdragon 425 chipset, 13 MP primary camera, 5 MP front camera, 2880 mAh battery, 32 GB storage, 2 GB RAM.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k30-.jpg"
  },
  {
    "name": "K31",
    "description": "LG K31 Android smartphone. Announced Aug 2020. Features 5.7″  display, MT6762 Helio P22 chipset, 3000 mAh battery, 32 GB storage, 2 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k31.jpg"
  },
  {
    "name": "K20 (2019)",
    "description": "LG K20 (2019) Android smartphone. Announced Aug 2019. Features 5.45″  display, MT6739 chipset, 3000 mAh battery, 16 GB storage, 1000 MB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k20-2019.jpg"
  },
  {
    "name": "K50",
    "description": "LG K50 Android smartphone. Announced Feb 2019. Features 6.26″  display, MT6762 Helio P22 chipset, 3500 mAh battery, 32 GB storage, 3 GB RAM, MIL-STD-810G compliant.",
    "img": "https://fdn2.gsmarena.com/vv/bigpic/lg-k50-.jpg"
  }
]